update diag
